attacker/data/ac+filtering+scaling+sio/spoofing/ab_results/ab_52.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   82.817 seconds
Complete requests:      20
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    1
Total transferred:      244 bytes
HTML transferred:       95 bytes
Requests per second:    0.24 [#/sec] (mean)
Time per request:       41408.692 [ms] (mean)
Time per request:       4140.869 [ms] (mean, across all concurrent requests)
Transfer rate:          0.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   1.3      5       6
Processing:     4 4144 18511.2      5   82790
Waiting:        0 4139 18511.9      0   82788
Total:          5 4149 18511.6     10   82796

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     10
  75%     11
  80%     12
  90%     12
  95%  82796
  98%  82796
  99%  82796
 100%  82796 (longest request)
